Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The shortcuts such as &shortcut:QuickJavaDoc; (View | Quick Documentation), &shortcut:ParameterInfo; (View | Parameter Info), &shortcut:GotoDeclaration; (Navigate | Declaration) and others can be used not only in the editor but in the code completion popup list as well.
zh_cn: 快捷键如 &shortcut:QuickJavaDoc; (View | Quick Documentation) ， &shortcut:ParameterInfo; (View | Parameter Info) ， &shortcut:GotoDeclaration; (Navigate | Declaration) 等，即可以用于编辑器，也可以用于弹窗中的代码补全。

source: The source code for all modules in the cycle will be compiled into the main module's output folders; All modules in the cycle will use the JDK assigned to the main module; Any JAR files created will be named after the name of the main module.
zh_cn: 循环中所有模块的源代码将被编译到主模块的输出文件夹中; 循环中的所有模块将使用分配给主模块的 JDK; 任何创建的 JAR 文件将以主模块的名称命名。

source: The specified disk or diskette cannot be accessed.
zh_cn: 指定的磁盘或软盘无法访问。

source: The specified file is a directory.
zh_cn: 指定的文件是一个目录。

source: The specified path to module file does not exist
zh_cn: 模块文件的指定路径不存在

source: The speed search is available in all the tree views: just start typing and you'll quickly locate the necessary item.
zh_cn: 所有树视图中都提供快速搜索：只需开始输入，您就可以快速找到所需的项目。

source: The storage control block address is invalid.
zh_cn: 存储控制块地址无效。

source: The storage control blocks were destroyed.
zh_cn: 存储控制块被破坏。

source: The system cannot find the device specified.
zh_cn: 系统无法找到指定设备。

source: The system cannot find the drive specified.
zh_cn: 系统无法找到指定的驱动器。

source: The system cannot find the file specified.
zh_cn: 系统无法找到指定的文件。

source: The system cannot find the path specified.
zh_cn: 系统无法找到指定的路径。

source: The system cannot move the file to a different disk drive.
zh_cn: 系统无法将文件移到不同的磁盘驱动器。

source: The system cannot open the file.
zh_cn: 系统无法打开文件。

source: The tab is hidden by default; use the Variables pane to manage the watches.
zh_cn: 该选项卡默认为隐藏;使用 Variables 窗格来管理观察点。

source: The transformation is performed based on the predefined template (Settings | Editor | General | Postfix Completion), the current context, and the expression type.
zh_cn: 转换基于预定义的模板(Settings | Editor | General | Postfix Completion)，当前上下文和表达式类型执行。

source: The type of field ''{0}'' is ''{1}''
zh_cn: 字段 ''{0}'' 的类型是 ''{1}''

source: The underlying image will be opened in a popup instead of a separate editor tab.
zh_cn: 底层图像将在弹出窗口中打开，而不是单独的编辑器选项卡。

source: The value changed at {0} is never used
zh_cn: 在 {0} 更改的值从未使用

source: The value will be recalculated
zh_cn: 该值将被重新计算

source: The value {0} assigned to {1} is never used
zh_cn: 分配给 {1} 的值 {0} 从未使用

source: The variants that contain the specified string as prefixes will be listed at the top of the suggestion list, followed by the variants with the arbitrary location of the search string.
zh_cn: 包含指定字符串作为前缀的变体将列在建议列表的顶部，随后是带有搜索字符串任意位置的变体。

source: The {0} directory
zh_cn: {0} 目录

source: The {1} file ''{0}'' already exists.
zh_cn: {1} 文件 ''{0}'' 已经存在。

source: Theme:
zh_cn: 主题:

source: Then click the browse button, in the Interpreters window click Add and choose the option Remote:
zh_cn: 然后点击浏览按钮，在解释器窗口中点击添加并选择选项 Remote：

source: Then click the gear button, and choose the option Add Remote:
zh_cn: 然后点击齿轮按钮，选择 Add Remote 操作：

source: Then return to your source code and press &shortcut:$Paste;:
zh_cn: 然后返回你的源码，按 &shortcut:$Paste;：

source: Then type the colon (:) and a line number.
zh_cn: 然后输入冒号 (:) 和行号。

source: Then use the "Built-in server port" spin box to set the new value.
zh_cn: 然后，使用 "Built-in server port" spin box 来设置新的值。

source: Then, in the pop-up window, choose [Reload Rake tasks list].
zh_cn: 然后，在弹出窗口中，选择 [Reload Rake tasks list]。

source: Then, in the pop-up window, choose [Reload generators list].
zh_cn: 然后，在弹出窗口中，选择 [Reload generators list]。

source: Then, use the "Built-in server port" spin box to set the new value.
zh_cn: 然后，使用 "Built-in server port" spin box 来设置新的值。

source: There are going to be multiple destination files with the same name
zh_cn: 有多个目标文件具有相同的名称

source: There are multiple exit points in the selected code fragment
zh_cn: 在选定的代码片段中有多个退出点

source: There are multiple output values for the selected code fragment:
zh_cn: 所选代码片段有多个输出值：

source: There are no active background tasks
zh_cn: 没有活动的后台任务

source: There are no changes
zh_cn: 没有变化

source: There are no classes found where this method can be implemented
zh_cn: 没有找到可以实现此方法的类

source: There are no committed changes in the repository
zh_cn: 仓库中没有提交的更改

source: There are no custom foldings in the current file.
zh_cn: 当前文件中没有自定义折叠。

source: There are no incoming changes
zh_cn: 没有传入的更改

source: There are no more files.
zh_cn: 没有更多文件。

source: There are no parameters that have reference type
zh_cn: 没有引用类型的参数

source: There are no tasks to run before launch
zh_cn: 在启动之前没有要运行的任务

source: There are no variables that have reference type
zh_cn: 没有具有引用类型的变量

source: There are source roots that are not under project roots.
zh_cn: 源码根目录不在项目根目录之下。

source: There are template data languages specified for the subdirectories.
zh_cn: 为子目录指定了模板数据语言。

source: There are two ways of closing all tabs in the editor, except the current one:
zh_cn: 有两种方法可以关闭编辑器中的除当前选项卡外的所有选项卡：

source: There are undefined path variables in project configuration files.
zh_cn: 项目配置文件中有未定义的路径变量。

source: There are undefined path variables in project file
zh_cn: 项目文件中有未定义的路径变量

source: There are unloaded modules in the project which depend on changed files.<br>Compilation of these modules finished with errors.
zh_cn: 项目中有卸载的模块依赖于已更改的文件。<br>这些模块的编译完成，但有错误。

source: There are unused methods that override methods you delete
zh_cn: 有一些未使用的方法覆盖了你删除的方法

source: There are {0} modules in the project but only {1} lines here
zh_cn: 项目中有 {0} 个模块，但这里只有 {1} 行

source: There are {0} modules in the project so line {1} doesn''t correspond to a module
zh_cn: 项目中有 {0} 个模块，所以第 {1} 行不对应模块

source: There is a more general exception, ''{0}'', in the throws list already.
zh_cn: 在 throws 列表中有一个更一般的异常 ''{0}''。

source: There is already a macro called ''{0}''.
zh_cn: 已经有一个名为 ''{0}'' 的宏。

source: There is already a {0} in the {1}.
zh_cn: {1} 中已经有 {0} 。

source: There is already a {0} in {1}
zh_cn: 已存在一个 {0} 在 {1} 中

source: There is already a {0} in {1}.
zh_cn: 已存在一个 {0} 在 {1} 中。

source: There is already a {0}.
zh_cn: 已经有一个 {0} 。

source: There is already method {0} which differs from getter {1} by return type only
zh_cn: 已经有方法 {0} 与 getter {1} 仅是返回类型不同

source: There is already method {0} which differs from setter {1} by return type only
zh_cn: 已经有方法 {0} 与 setter {1} 仅是返回类型不同

source: There is circular dependency between {0}
zh_cn: {0} 之间存在循环依赖关系

source: There is no default constructor available in ''{0}''
zh_cn: ''{0}'' 中没有可用的默认构造函数

source: There is no executable code at {0}:{1}
zh_cn: 在 {0}:{1} 中没有可执行代码

source: There is no help for this dialog
zh_cn: 这个对话框没有相关帮助

source: There is nothing to display.
zh_cn: 没有可显示的内容。

source: There is {0} in ''{1}''.
zh_cn: ''{1}'' 中有 {0} 。

source: There should be a space between attribute and previous attribute
zh_cn: 属性和上一个属性之间应该有一个空格

source: There was {1}
zh_cn: 有 {1}

source: There were changes in code after usages have been found.
zh_cn: 找到使用以后有代码变化了。

source: There were plugins without id found, all such plugins were skipped.
zh_cn: 发现有插件没有 id，已跳过所有这些插件。

source: There will be no lightbulb shown for this particular action but you will be still able to use it with the &shortcut:ShowIntentionActions; shortcut.
zh_cn: 对于该操作将不会有灯泡显示，但你仍然可以通过 &shortcut:ShowIntentionActions; 来使用它。

source: There {0, choice, 1#is one hunk|2#are {0, number} hunks} left unprocessed.
zh_cn: 有 {0} 块未处理。

source: There's no need to start from the beginning of the generator name.
zh_cn: 没有必要从生成器名称的开头开始。

source: There's no need to start from the beginning of the task name.
zh_cn: 没有必要从任务名称的开始处开始。

source: These package prefixes will be changed.
zh_cn: 这些包前缀将被改变。

source: These paths correspond to default (root, unnamed, top level) packages.
zh_cn: 这些路径应对应于默认(root，未命名，顶级)包。

source: These tips will be shown while the start up process is going on.
zh_cn: 这些提示将在启动过程中显示。

source: These tips will be shown while the startup process is going on.
zh_cn: 这些提示将在启动过程中显示。

source: They are visible in the Favorites tool window, which you can dock or float as required:
zh_cn: 你可以在 Favorites 工具窗口看到它们，该窗口可以根据需要设置为停靠或浮动：

source: They do not support developing Java applications.
zh_cn: 他们不支持开发 Java 应用程序。

source: This Class
zh_cn: 该类

source: This IDE is running on a Java JRE instead of a full Java JDK.<br>This does not work; debugging (among other features) will not work.<br>You must configure the boot JDK (via Help > Find Action... > Switch IDE boot JDK.)
zh_cn: 这个 IDE 运行在 Java JRE 上，而不是一个完整的 Java JDK。<br>这不工作; 调试(除其他功能)将不起作用。<br>您必须配置启动 JDK(通过 帮助 > 查找操作... > Switch IDE boot JDK.)

source: This IDEA distribution is only licensed to be used with JetBrains TeamCity.
zh_cn: 此 IDEA 分发仅被授权于 JetBrains TeamCity 使用。

source: This SDK will be used by default by all project modules.
zh_cn: 该 SDK 将被所有项目模块默认使用。

source: This action is also available from the context menu (Git | Annotate) on a file.
zh_cn: 此操作也可从文件上的上下文菜单(Git | Annotate)使用。

source: This action will also optimize import statements and delete unused ones.
zh_cn: 此操作还将优化导入语句并删除未使用的语句。

source: This behavior is enabled, if None is selected from the Case sensitive completion drop-down list (the Code Completion page of the Editor settings).
zh_cn: 当在 Case sensitive completion 下拉列表中选择 None 时(编辑器设置中的 Code Completion 页)，该行为生效。

source: This can be especially useful for replacing one method or variable name with another.
zh_cn: 这对于将一个方法或变量名替换为另一个方法或变量名时尤其有用。

source: This can be useful, for example, when you need to create a class which has much in common with some existing class and it's not feasible to put the shared functionality in a common superclass.
zh_cn: 这有时是有用的，比如，当您需要创建一个与现有类有很多共同点的类，而将共享功能放在一个共同的超类中又是不可行的时候。

source: This data is anonymous, does not contain any personal information, collected for use only by {0} and will never be transmitted to any third party.
zh_cn: 该数据是匿名的，不包含任何个人信息，仅由 {0} 收集，不会传送给任何第三方。

source: This dialog shows all modifications in project, gives summary information of file status and suggests improvements before check-in.
zh_cn: 此对话框显示项目中的所有修改、给出文件状态的摘要信息和检入前的建议改进。

source: This document contains very long lines.
zh_cn: 本文档包含很长的行。

source: This element cannot be renamed
zh_cn: 此元素不能被重命名

source: This file is indented with tabs instead of {0} spaces
zh_cn: 此文件缩进用的制表符,而不是 {0} 空格

source: This file is indented with {0} spaces instead of the tab character
zh_cn: 此文件是缩进 {0} 空格代替制表符

source: This file is indented with {0} spaces instead of {1}
zh_cn: 此文件缩进用的 {0} 空格,而不是 {1}

source: This intention action will not even make you change your current editing location.
zh_cn: 此意图操作甚至不会更改您当前的编辑位置。

source: This is most easy.
zh_cn: 这很简单。

source: This license is being used elsewhere on the network by {0}.
zh_cn: 该许可证在网络上的其他地方被 {0} 使用。

source: This member does not seem to belong to any class
zh_cn: 此成员似乎不属于任何类

source: This method
zh_cn: 这种方法

source: This name is already used
zh_cn: 此名称已被使用

source: This operation cannot be undone.
zh_cn: 此操作无法撤消。

source: This path should correspond to default (root, unnamed, top level) package.
zh_cn: 该路径应对应于默认(root，未命名，顶级)包。

source: This pattern is malformed
zh_cn: 此模式格式错误

source: This pattern is unsupported
zh_cn: 此模式不受支持

source: This plugin is not a production of JetBrains.
zh_cn: 该插件不是 JetBrains 的产品。

source: This project contains no modules.
zh_cn: 该项目不包含模块。

source: This usage search requires indices and cannot be performed until they are built
zh_cn: 使用搜索需要索引，并且在索引被建立之前不能被执行

source: This variable is target of the search
zh_cn: 该变量是搜索的目标

source: This view is read-only
zh_cn: 此视图是只读的

source: This wildcard is already registered by ''{0}'' filetype
zh_cn: 该通配符已经被 ''{0}'' 文件类型注册

source: This wildcard is reserved for ''{0}'' filetype and cannot be reassigned
zh_cn: 这个通配符是为 ''{0}'' 文件类型预留的,不能重新分配

source: This will also work for try and catch.
zh_cn: 这也适用于 try 和 catch。

source: This will attempt to use your system settings and is useful if your system uses a proxy autoconfiguration file (.pac).
zh_cn: 这将尝试使用您的系统设置，这将有用如果您的系统使用代理自动配置文件(.pac)。

source: This will automatically generate the except clause.
zh_cn: 这将自动生成 except 子句。

source: This will result in the following:
zh_cn: 这将生成以下内容：

source: This works in the Ruby code and ERB/RHTML files inside Ruby on Rails projects.
zh_cn: 这适用于 Ruby on Rails 项目中的 Ruby 代码和 ERB / RHTML 文件。

source: This would result in the following:
zh_cn: 这将导致以下结果：

source: This {0} ''{1}'' belongs to {2}.
zh_cn: 这个 {0} ''{1}'' 属于 {2} 。

source: Those occurrences will not be changed
zh_cn: 这些匹配项不会改变。

source: Though ''{0}'' depends on ''{2}'' through exported dependencies of ''{1}''
zh_cn: 虽然 ''{0}'' 依赖 ''{2}'' 通过 ''{1}'' 导出的依赖关系

source: Though ''{1}'' was not inspected for exported dependencies needed for scope ''{2}''
zh_cn: 尽管 ''{1}'' 没有检查范围 ''{2}'' 的导出的依赖需要

source: Though ''{2}'' depend on ''{1}'' through this exported dependency
zh_cn: 虽然 ''{2}'' 依赖 ''{1}'' 通过导出的依赖

source: Thread
zh_cn: 线程

source: Thread ''{0}'' has been garbage-collected
zh_cn: 线程 ''{0}'' 被垃圾回收

source: Thread Group "{0}" has been garbage-collected
zh_cn: 线程组 "{0}" 被垃圾回收

source: Thread Group "{0}"@{1}
zh_cn: 组程组 "{0}"@{1}

source: Thread has been collected
zh_cn: 线程已经被回收

source: Thread has been resumed
zh_cn: 线程已被恢复

source: Thread has no frames
zh_cn: 线程没有帧

source: Thread is running
zh_cn: 线程正在运行

source: Threading issues
zh_cn: 线程问题

source: Threads
zh_cn: 线程

source: Threads are not available
zh_cn: 线程不可用

source: Throw Debug Exception
zh_cn: 抛出调试异常

source: Throw Exception
zh_cn: 抛出异常

source: Throw an exception
zh_cn: 抛出一个异常

source: Throws keyword
zh_cn: Throws 关键字

source: Throws list
zh_cn: Throws 列表

source: Throws:
zh_cn: 抛出:

source: Thus you create a complete Examples section, with the table header row, and syntactically highlighted placeholders.
zh_cn: 因此，您可以创建一个完整的示例部分，其中包含表头行和语法高亮显示的占位符。

source: Time elapsed
zh_cn: 耗时

source: Timed out
zh_cn: 超时

source: Tip of the Day
zh_cn: 每日提示

source: Tips Of The Day are not ready yet.
zh_cn: 每日提示还没有准备好。

source: Tips not found.
zh_cn: 没有找到提示。

source: Title
zh_cn: 标题

source: Title Color
zh_cn: 标题颜色

source: To &clipboard
zh_cn: 到剪贴板(&C)

source: To &directory:
zh_cn: 到目录：(&D)

source: To &file:
zh_cn: 到文件：(&F)

source: To (fully qualified name):
zh_cn: 到 (完全限定名称):

source: To New Subgroup...
zh_cn: 到新的下级组...

source: To Spaces
zh_cn: 转换缩进为空格

source: To Tabs
zh_cn: 转换缩进为制表符

source: To This Group
zh_cn: 到这个组

source: To access Rails generators quickly, press &shortcut:org.jetbrains.plugins.ruby.rails.actions.generators.GeneratorsPopupAction; or use Tools | Run Rails Generator and start typing the generator name.
zh_cn: 要快速访问 Rails 生成器，请按 &shortcut:org.jetbrains.plugins.ruby.rails.actions.generators.GeneratorsPopupAction; 或使用 Tools | Run Rails Generator 并开始输入生成器名称。

source: To access the corresponding settings, use File | Settings | Code Style | Imports.
zh_cn: 要访问相应的设置，使用 File | Settings | Code Style | Imports 。

source: To add a name to a breakpoint, show the list of all breakpoints (&shortcut:ViewBreakpoints;), right-click the one you are interested in, and edit its description.
zh_cn: 要为断点添加名称，请显示所有断点的列表(&shortcut:ViewBreakpoints;)，右键单击您感兴趣的断点并编辑其描述。

source: To add another caret at a specific place in the code, left-click that place in the editor while holding Alt+Shift.
zh_cn: 要在代码的特定位置添加另一个插入符号，请在按住 Alt+Shift 的同时在编辑器中左键单击该位置。

source: To add item to favorites list use: Main Menu -> View -> Add To Favorites
zh_cn: 要添加项目到收藏夹列表，请使用：主菜单 - >查看 - >添加到收藏夹

source: To apply a fix for the issue at the caret, press &shortcut:ShowIntentionActions; and choose the quick-fix.
zh_cn: 要对插入的问题应用修补程序，请按 &shortcut:ShowIntentionActions; 并选择快速修复。

source: To change the current line ending style, just click the spinner.
zh_cn: 要更改当前换行符样式，只需单击 spinner。

source: To compare two directories, select one or both of them in the Project view and press &shortcut:CompareDirs;.
zh_cn: 要比较两个目录，在 Project 视图中选择一个或两个都选中，然后按 &shortcut:CompareDirs;。

source: To compare two jar files, select one or both of them in the Project view and press &shortcut:CompareDirs;.
zh_cn: 要比较两个 jar 文件，在 Project 视图中选择一个或两个都选中，然后按 &shortcut:CompareDirs;。

source: To configure a remote interpreter, press &shortcut:ShowSettings;, and open the PHP page.
zh_cn: 要配置远程解释器，按 &shortcut:ShowSettings; ，然后打开 PHP 页。

source: To configure a remote interpreter, press &shortcut:ShowSettings;, and under the Project: <name> node, open the page Project Interpreter.
zh_cn: 要配置远程解释器，按 &shortcut:ShowSettings; ，然后在 Project: <name> 节点，打开 Project Interpreter 页。

source: To configure automatic update settings, see the <b><a href="updates">Updates</a></b> dialog of your IDE {0}.
zh_cn: 要配置自动更新设置，请参阅 IDE {0} 的 <b><a href="updates">更新</a></b> 对话框。

source: To create a scratch file, press &shortcut:NewScratchFile;, and then select its language.
zh_cn: 要创建临时文件，按 &shortcut:NewScratchFile;，然后选择语言。

source: To delete an occurrence of a search string from a multiselection, press &shortcut:UnselectPreviousOccurrence;.
zh_cn: 要从搜索字符串的匹配项的多选中删除一个，按 &shortcut:UnselectPreviousOccurrence; 。

source: To directory:
zh_cn: 到目录：

source: To do that, it's enough to keep Alt+Shift and drag your mouse cursor:
zh_cn: 要这样做，只需按住 Alt+Shift ，然后拖支鼠标光标：

source: To do that, just choose Move to Another Changelist on the file context menu in the Version Control tool window:
zh_cn: 要这样做，只需在版本控制工具窗口的上下文菜单中选择 Move to Another Changelist 。

source: To do that, just choose Move to Changelist on the file context menu in the Local Changes tab of the Version Control tool window:
zh_cn: 要这样做，只需在版本控制工具窗口的上下文菜单中选择 Move to Changelist 。

source: To do that, just choose Move to Changelist on the file context menu in the Version Control tool window:
zh_cn: 要这样做，只需在版本控制工具窗口的上下文菜单中选择 Move to Changelist 。

source: To do that, place the caret at a module or class name and then press &shortcut:Move;.
zh_cn: 为此，请将插入符号放在模块或类名称中，然后按 &shortcut:Move;。

source: To do that, place the caret at the symbol's name or at its usage in code and press &shortcut:ShowUsages; (Edit | Find | Show Usages in the main menu), scroll the list and click the desired usage.
zh_cn: 要这样做，将插入符号置于符号的名称处或代码中它的使用处，然后按下 &shortcut:ShowUsages; (在主菜单中的 Edit | Find | Show Usages )，滚动列表并点击期望的使用。

source: To do that, press &shortcut:GotoAction; twice, type Clone caret, and then choose the desired action.
zh_cn: 要做到这样，按下 &shortcut:GotoAction; ，输入 Clone caret 并选择所需的操作。

source: To do that, press &shortcut:GotoAction;, type Clone caret, and then choose the desired action.
zh_cn: 要做到这样，按下 &shortcut:GotoAction; ，输入 Clone caret 并选择所需的操作。

source: To do that, press Ctrl twice and hold the key, and then press the arrow keys.
zh_cn: 要做到这一点，按下 Ctrl 两次并按住，然后按方向键。

source: To do that, press the key Alt (for Windows/*nix) or Cmd (for Mac) twice and keep it down.
zh_cn: 要做到那样，按下两次 Alt (for Windows/*nix) 或 Cmd (for Mac) 并保持按下。

source: To do that, press the key Alt (for Windows/*nix) or Command (for Mac) twice and keep it down.
zh_cn: 要做到那样，按下两次 Alt (for Windows/*nix) 或 Command (for Mac) 并保持按下。

source: To do that, select a character, and then on the main menu choose Edit | Encode XML/HTML Special Characters.
zh_cn: 要做到这一点，选择一个字符，然后在主菜单选择 Edit | Encode XML/HTML Special Characters。

source: To do that, use &shortcut:MoveElementLeft;/&shortcut:MoveElementRight;.
zh_cn: 要这样做，可以使用 &shortcut:MoveElementLeft;/&shortcut:MoveElementRight;。

source: To do that, use the icons and in the left gutter of the editor.
zh_cn: 要这样做，请使用编辑器左边 gutter 上的 和 图标。

source: To do that, use the icons or in the left gutter of the editor.
zh_cn: 要这样做，请使用编辑器左边 gutter 上的 或 图标。

source: To do that, use the same &shortcut:RecentFiles; shortcut with the Find tool window having the focus, and select the desired find usages result from the Recent Find Usages popup.
zh_cn: 要做到这一点，当 Find 工具窗口有焦点时，使用相同的 &shortcut:RecentFiles; ，然后从 Recent Find Usages 弹窗中选择所需的使用查找结果。

source: To easily evaluate the value of any expression while debugging the program, select its text in the editor (you may press a &shortcut:EditorSelectWord; a few times to efficiently perform this operation) and press &shortcut:EvaluateExpression;.
zh_cn: 要在调试程序时轻松计算任何表达式的值，请在编辑器中选择其文本(你可能会按 &shortcut:EditorSelectWord; 几次来高效地执行该操作)，然后按 &shortcut:EvaluateExpression;。

source: To easily evaluate the value of any expression while debugging the program, select its text in the editor (you might want to press a &shortcut:EditorSelectWord; a few times to efficiently perform this operation) and then press &shortcut:EvaluateExpression;.
zh_cn: 要在调试程序时轻松计算任何表达式的值，请在编辑器中选择其文本(你可能会按 &shortcut:EditorSelectWord; 几次来高效地执行该操作)，然后按 &shortcut:EvaluateExpression;。

source: To easily locate an item in the list, just start typing its name.
zh_cn: 要轻松找到列表中的项目，只需开始输入其名称。

source: To enable this feature, select the check box Show quick doc on mouse move in the General page of the editor settings:
zh_cn: 要启用该功能，在编辑器设置中的 General 页选中复选框 Show quick doc on mouse move 。

source: To enable this feature, select the check box Show quick doc on mouse move in the editor settings.
zh_cn: 要启用该功能，在编辑器设置中选中复选框 Show quick doc on mouse move 。

source: To extend or shrink the selection at the caret, press &shortcut:EditorSelectWord; (Edit | Extend Selection) or &shortcut:EditorUnSelectWord; (Edit | Shrink Selection).
zh_cn: 要扩展或缩小插入符号处的选择，按下 &shortcut:EditorSelectWord;(Edit | Extend Selection)或 &shortcut:EditorUnSelectWord; (Edit | Shrink Selection)。

source: To find the author who last made changes to a specific line of code, right-click the left gutter and select Annotate.
zh_cn: 要查找最后一次对特定代码行进行更改的作者，请右键单击左侧的 gutter 并选择 Annotate。

source: To find where a certain text is used across all project files, press &shortcut:FindInPath; (Edit | Find | Find in Path), enter a search expression (regular expressions are supported), and then choose the search scope.
zh_cn: 要找到在所有项目文件中使用某个文本的位置，请按 &shortcut:FindInPath;（Edit | Find | Find in Path），输入搜索表达式（支持正则），然后选择搜索范围。

source: To get JPDA libraries please visit
zh_cn: 要获得 JPDA 库，请访问

source: To get only those code completion suggestions that are applicable in the current context, press &shortcut:SmartTypeCompletion; (Code | Completion | SmartType).
zh_cn: 要仅获取适用于当前上下文的代码完成建议，请按 &shortcut:SmartTypeCompletion;(Code | Completion | SmartType)。

source: To get this type of completion, press &shortcut:HippieCompletion; (Code | Completion | Cyclick Expan Word) and &shortcut:HippieBackwardCompletion; (Code | Completion | Cyclick Expan Word Backward).
zh_cn: 要获得该类型补全，按 &shortcut:HippieCompletion;(Code | Completion | Cyclick Expan Word)和 &shortcut:HippieBackwardCompletion; (Code | Completion | Cyclick Expan Word Backward)。

source: To have a statement completed, press &shortcut:EditorCompleteStatement; (Code | Complete Current Statement).
zh_cn: 要补全语句，请按 &shortcut:EditorCompleteStatement; (Code | Complete Current Statement)。

source: To help you learn the purpose of each item in the main menu, its short description is shown in the status bar at the bottom of the application frame when you position the mouse pointer over this item.
zh_cn: 为了帮助您了解主菜单中每个项目的用途，当您将鼠标指针放在该项目上时，它的简短描述将显示在应用程序框架底部的状态栏中。

source: To implement methods of the interfaces that the current class implements (or of the abstract base class), use &shortcut:ImplementMethods; (Code | Implement methods).
zh_cn: 要实现当前类继承的接口的方法（或抽象类的方法），使用 &shortcut:ImplementMethods; (Code | Implement methods)。

source: To insert the stub into the code at the caret, press &shortcut:Generate; (Code | Generate) and choose the stub.
zh_cn: 要将存根插入插入符号中的代码，请按 &shortcut:Generate;(Code | Generate)并选择存根。
